read_verilog cpu.v alu.v regfile.v alucontrol.v control.v immgen.v pccalc.v storegen.v wdatagen.v 
synth_xilinx -top cpu
write_verilog cpu_synth.v
